package Demos.Chapter07

object Scala01_Collection extends App {

  //todo 集合-java
  //java的集合主要有三大类：
  //List：存储有序，数据可重复
  // ArrayList& LinkedList
  //set：存储无序，数据不可以重复
  //Hashset & TreeSet
  //map：存储kv键值时，key是不能重复的，value时可以重复的。无序的
  //HashMap & Hashtable & TreeMap

  //Java是一个面向对象的语言，所以学习集合的时候，更侧重数据之间的关系，以及数据结构之间的关系
  // Scala是一个面向函数式的语言，所以学习集合的时候，更侧重本身的功能
  //scala集合主要也分为三大类：
  //1。 Seq：存储有序，数据可重复
  //2. Set：存储无序，数据不可以重复
  //3. Map：存储无序，存储kv键值时，key是不能重复的，value时可以重复的。无序的

  //***********************************************************
  //String & StringBuilder
  //String 不可变字符串，因为类没有提供改变其内容的方法。如果有，是创建
  //StringBuilder 可变字符串，很多方法就是改变自身的内容
  // ***********************************************************
  //scala中的集合也分两大类
  //不可变集合&可变集合
  //原始数据：处理数据时，一般要从数据源获取数据，但是数据源的数据一般不能被改变的
  //      如果必须要改变，也是创建的新的数据
















}
